# Assignment

## Brief

Write the Python codes for the following questions.

## Instructions

Paste the answer as Python in the answer code section below each question.

### Question 1

Question: How do you select rows from a DataFrame where any value in the row exceeds a threshold?

In [40]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
threshold = 30
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [52]:
df[(df>threshold)]

    A     B
0 NaN   NaN
1 NaN   NaN
2 NaN   NaN
3 NaN  40.0
4 NaN  50.0

In [54]:
df[(df>threshold).any(axis=1)]

   A   B
3  4  40
4  5  50

### Question 2

Question: How do you sort a DataFrame by columns `A` and `B`?

In [18]:
df = pd.DataFrame({'A': [2, 1, 2], 'B': [2, 3, 1], 'C': [1, 2, 3]})
df

   A  B  C
0  2  2  1
1  1  3  2
2  2  1  3

In [19]:
df.sort_values(by=['A', 'B'], ascending=[True, True], inplace=True)
df

   A  B  C
1  1  3  2
2  2  1  3
0  2  2  1

### Question 3

Question: How do you concatenate two DataFrames vertically?

In [20]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})
df1

   A  B
0  1  4
1  2  5
2  3  6

In [21]:
df2

   A   B
0  7  10
1  8  11
2  9  12

In [22]:
df3=pd.concat([df1, df2], ignore_index=True)
df3

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

### Question 4

Question: How do you compute the cumulative sum of a column in a DataFrame?

In [23]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5]})
df

   A
0  1
1  2
2  3
3  4
4  5

In [25]:
df['A'].cumsum()

0     1
1     3
2     6
3    10
4    15
Name: A, dtype: int64

### Question 5

Question: How do you convert a Series of strings to uppercase?

In [29]:
series = pd.Series(['apple', 'banana', 'cherry'])

In [30]:
series.str.upper()

0     APPLE
1    BANANA
2    CHERRY
dtype: object